package com.postgraduate.entity;

/**
 * Created by zhao on 2016/12/3.
 */
public class ReqStatus {
    public static final int BASE = 6;
    public static final String[] status = {"未知错误！","失败！学生已经被正式录取！",
            "失败！学生预录取名额已满！","失败！导师正式录取名额已满！","失败！导师预录取名额已满！",
            "预录取请求已发送！","已经发送预请求，对方还未审查！","对方已阅读您的预请求，请耐心等待回应！",
            "你们已经通过了预请求关系！","你们曾经建立预请求关系失败，无法再发送请求！","你们已经建立了预请求关系，并有了最终关系请求！",
            "你们已经建立了预请求关系，并有了最终关系请求！","无法发送！你们已经建立了最终的录取关系！",
            "你们最终录取请求未通过，无法再发送请求！"
    };
}
